<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"fff2ce1d58afa8084bc1b24b9f6c06f307b4431837eac2db358f5e1f4c62efaf","plan_job_ref":"Job Validations on PR #69 at https://github.com/SelfOverflow/discord-bots/actions/runs/22867353308","plan_out_hash":"0a76b38ca20327a59962059cbc7b2ffdc983254388c3053789b4b4d12668874c","plan_hash":"fead5548f0002280c5c6a8507472e73bec6c3e8ae607c33ea23d1e9174ae6b41","plan_text_format":"diff","version":"2.0.0","closed":true} -->
Terraform plan in __./apps/bablu/terraform__
With variables: `image_tag = "40f376d8a53e52ec020be9e6f8ba0ac0bbb10722"`
<details>
<summary>Plan: 1 to add, 1 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_service.bot will be updated in-place
!~  resource "aws_ecs_service" "bot" {
        id                                 = "arn:aws:ecs:ap-south-1:613419461354:service/bablu-bot-cluster/bablu-bot-service"
        name                               = "bablu-bot-service"
        tags                               = {
            "Environment" = "mono"
            "ManagedBy"   = "terraform"
            "Project"     = "bablu-bot"
        }
!~      task_definition                    = "arn:aws:ecs:ap-south-1:613419461354:task-definition/bablu-bot-task:10" -> (known after apply)
#        (15 unchanged attributes hidden)

#        (2 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.bot must be replaced
-/+ resource "aws_ecs_task_definition" "bot" {
!~      arn                      = "arn:aws:ecs:ap-south-1:613419461354:task-definition/bablu-bot-task:10" -> (known after apply)
!~      arn_without_revision     = "arn:aws:ecs:ap-south-1:613419461354:task-definition/bablu-bot-task" -> (known after apply)
!~      container_definitions    = jsonencode(
!~          [
!~              {
+                   cpu              = 1
!~                  image            = "613419461354.dkr.ecr.ap-south-1.amazonaws.com/bablu-container-repository:a90b06aa33a2bdf0d56fe9ac8613a54dd95a9d7d" -> "613419461354.dkr.ecr.ap-south-1.amazonaws.com/bablu-container-repository:40f376d8a53e52ec020be9e6f8ba0ac0bbb10722"
-                   mountPoints      = []
                    name             = "bot"
-                   portMappings     = []
-                   systemControls   = []
-                   volumesFrom      = []
#                    (5 unchanged attributes hidden)
                },
            ] # forces replacement
        )
!~      enable_fault_injection   = false -> (known after apply)
!~      id                       = "**************" -> (known after apply)
!~      revision                 = 10 -> (known after apply)
        tags                     = {
            "Environment" = "mono"
            "ManagedBy"   = "terraform"
            "Project"     = "bablu-bot"
        }
#        (12 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.
```
</details>

:white_check_mark: Plan applied in [Post merge deploy to production #44](https://github.com/SelfOverflow/discord-bots/actions/runs/22867445080)
<details><summary>Outputs</summary>

```hcl
ecr_repository_url     = "613419461354.dkr.ecr.ap-south-1.amazonaws.com/bablu-container-repository"
ecs_cluster_name       = "bablu-bot-cluster"
ecs_execution_role_arn = "arn:aws:iam::613419461354:role/bablu-bot-ecs-execution-role"
ecs_security_group     = "sg-0b82388ca3a1ccc0c"
ecs_task_role_arn      = "arn:aws:iam::613419461354:role/bablu-bot-ecs-task-role"
public_subnets         = [
    "subnet-098c041204c05f1ab",
    "subnet-06a6f4c66b4b20bf4",
]
vpc_id                 = "vpc-032c55070aacaa29e"
```
</details>